import json
from prettytable import PrettyTable



possible_unit = ['.แป้งมันถุงเล็ก', 'ต้นน', 'ถุงเล็ก', 'gram', 'เหยาะยาะ', 'แก้วครึ่ง', 'ข้อนชา', 'หัวใหญ', 'ก้อนครึ่ง', 'ก้อน', 'ช้อนพูนๆ', 'ห่อเล็ก', 'มิล', 'หยิกมือ', 'L', 'cup', 'ชม', 'ตะกร้า', 'ช้อนกาแฟพูนๆ',
                 '.ใบเตย', '.รากผักช', 'กล่องกะท', 'ช.ต', 'ซีซ', 'ซีกเล็กๆ', 'ผล', 'มะเขือเปราะ', 'ขิ้น', 'ลูกกลาง', 'Serving', 'กระเทียม', 'กลีม', 'แต่ใช้ฟองเล็กใช', 'ข้อนโต๊ะ', 'กรม', 'ดอกใหญ', '.เห็ดนางฟ้า',
                 'อันเล็ก', 'กุ้งสดไซน์ใหญ่ปอกเปลือก', 'Cup', 'ไก่หั่นเป็นชิ้น', 'กิโลขึ้นไป', 'ซอง', 'เส้นใหญ', '.ซอสข้นปรุงรสคนอร', '.น้ำปลา', 'นาน', 'ตัวโลขึ้นไป', 'หม้อ', 'ถวย', '.กุ้งสด', 'กร', 'แหง่ง', '.ขึ้นฉ่าย',
                 'แพ็ก', 'ลิจร', 'ลูก', 'ตราเด็กสมบูรณ', 'หมึก', 'น้ำมัน', 'ตัวเล็ก', 'คนขึ้นไป', '.กะทิกล่', 'ช้อนชาพูน', 'เศษเนื้อ', 'Kg', 'tbsp', 'หลอด', 'ต้าน', 'แป้งข้าวจ้าว', 'ตีน', 'Servings', 'กบ', 'หัวกลางๆ',
                 '.พริกขี้หนูบุบ', '.ตะไคร', 'เพราะน้ำปูนใสจะช่วยให้ขนมมีความกรอบนาน', 'เมล็ด', 'ชอ้นชา', 'หน้อไม้สด', 'กล่องกระท', 'อกใหญ', 'person', 'กบ่อง', 'ถั่วพล', 'กลีบใหญ', 'หยดสีออกมาสวยถูกใจ', 'สปาเกต',
                 'หยด', 'จาก', 'cc', 'ทับพ', 'พวง', 'แท่งใหญ', 'ของหม้อ', 'ราก', 'ลิตร..แบ่งทำไก่ใต้น้', 'ไก', 'tps', 'กิโลกรัม', 'ต้น', 'ช้อนโต็ะ', 'ช้อนโตผ๊ะ', 'โลครึ่ง', 'ช่้อนโต๊ะ', 'หน่อเล็ก', 'ช้อนโต๊ะหริอตามชอบ',
                 'ผงพะโล', 'หมูสับ', 'กำมือใหญ่ๆ', 'ปั้น', 'กำเล็ก', 'ครึ่ง', 'ใบใช', 'แก้ว', 'ไก่สับ', 'ก.ก', 'กระป๋องใหญ', 'กลีบ', 'กระทง', 'คืน', 'น้ำพริกแกงเผ็ด', 'ถ้วยครึ่ง', '.ผักชีใบเลื่อย', 'แง', 'tbs', 'เนื้อสันคอหม',
                 'เส้น', 'เม็ดหรือตามชอบ', '.แป้งข้าวเหนียว', 'Pack', '.เกลือ', 'ถ้วยขึ้นไป', 'KG', '.กุ้งแม่น้ำ', 'ฟักทองหั่นเป็นชิ้นพอดีคำ', 'ลูกครึ่ง', 'สะโพกไก', 'กะละมัง', 'ข้าวสวย', '.กระเทียมสับหยาบ', '.ซอสหอยนางรม',
                 'servinga', 'ร่ก', 'ท่านแบบอิ่มมากๆ', 'ชต', 'โครง', 'อก', 'ml', 'ชอ้นโต๊ะ', 'หัวเล็กๆ', 'น้ำมันสำหรับผัด', 'ฝา', 'แม่ครัวฉลากทอง', 'บาท', 'Oz', 'ถ้วน', 'น้ำ', 'ช้อนช้า', 'ไข่แดงของไก', 'ท่่น', 'ก้อนปลายนิ้ว',
                 'ลิตรเล็ก', 'ปีกไก่กลาง', 'ท่า', 'บ', 'ช้อโต๊ะ', 'นาท', 'ตะบวย', 'mL', 'กระจับ', 'จาน', 'ก้อนเล็ก', '.สาคูเม็ดเล็', 'นาทีสูตรด้านล่าง', 'แพ็ค', 'กัว', 'เกลื', 'จานเสริฟ', 'serves', 'หรือตามชอบ', 'ช้อนต๊ะ', 'ถ้วยแกง',
                 '.มะพร้าวทึนทึกขูดแล้วนึ่', '.คื่นช่าย', 'ปอนด', 'ไข่ไก', 'หยิบ', '.ซีอิ้วดำ', 'จานหรือตามใจชอบ', 'ปลาทูหอม', 'ช้อนโต๊ะ', '.มะนาว', 'หยิบม', 'ขข', 'ชต..หลังจากใส่น้ำซุปหุงข้าวลงไปให้ใส่น้ำมันหอยเพิ่มลงไปอีก', 'กลีบกลางๆ',
                 'ช้อนโต้ะ', 'ความคิดเห็น', 'ฟักทอง', 'ต่', '.เกลือป่น', 'ค้น', 'เส้นยาว', 'กรีม', 'เนื้อไก่บด', 'บด', 'ข้อนิ้ว', 'ช้อนสำหรับหมักไก่บด', 'ชามใหญ', 'ไข่มดแดง', 'cm', 'วินาท', 'หม้อกลางๆ', 'ช้อนพูน', 'ช้อนขา', 'กล้วยน้ำว้า',
                 'ชชค', 'ปีก', 'ดุ้นสั้น', 'ขวดเล็ก', 'ส่วน', 'ไปจนถึง', 'กุ้ง', 'ชค', 'หม้อเบอร', 'มล', 'กลีบกลาง', 'หัวเล็ก', 'กลีบเล็ก', 'ขีด', 'ข้อ', 'เม็ดพริกไทยดำ', 'แป้งข้าวเหนียว', 'หน่อ', 'ช้อนครึ่ง', 'ซอส', 'พับ', 'ชต.ใส่ตอนตุ๋นต้ม',
                 'เส้นเล็ก', 'ถค', 'ดวง', 'แพ๊ค', 'กุ้งขนาดกลาง', 'เหง้า', 'นาทีก็ได้กินของอร่อยแล้ว', 'ครึ่งช้อนชา', 'ขยุ้ม', '.คอหม', 'ทาน', 'ครก', 'แว่น', 'หยิบนิ้ว', '.แห้วดิบปลอกเปลือก', '.พริกไทยเม็ด', 'สามเกลอ', 'โคน', 'ทัพพ', 'กิ่ง',
                 'หมก', 'หยิบเล็ก', 'ก้าน', 'กล่องกลาง', 'ถ้วยตวงข้าว', 'ถ้วยใหญ', 'ท่าย', 'ลต', 'ถ้วยโต๊ะ', 'แว่นเล็ก', 'ซม', 'หม้อเล็ก', '.ช้อนโต๊ะ', 'เหยาะ', 'ที่สำหรับ', 'จานเสิร์ฟ', '.แตงไทยสุ', 'กก.ครึ่ง', 'ชิ้นเท่านิ้วโป้ง', 'เหยือก',
                 'ถ้วยน้ำซุป', 'ผ', 'ถัวยตวง', 'ถ้วยชามสำหรับ', 'ช้อนนโต๊ะ', 'ถ้วยพูนๆ', 'serve', 'เท่าของไข', 'แถว', 'กรัมมือ', 'หน่', 'ห้อกลาง', 'หัวกลาง', 'จานใหญ', 'ตัว', 'ช้อนแกง', 'ช้อชา', 'เม็ดมะม่วงหิมพาน', 'ครึ่งโล', 'serving',
                 'กีห', 'ขีดครึ่ง', 'ท่านต่', 'g', 'เสริฟ', 'เนื้อไก่สับ', 'กระทะ', 'เส้นกลาง', 'เม็ดแล้วแต่ชอบ', 'ปึก', 'ซี่โครงหม', '.มะพร้าวขู', 'หัวปานกลาง', 'บะหมี่หยก', 'กระจุก', 'ถ้วยพูน', 'เด็ก', 'มิลิลิตร', 'ช้อนชาครึ่ง', 'กรัม', 'คนทาน',
                 'กป', 'ชช', 'หม้อกินและแจกเพื่อน', 'สูตร', 'ชต.พูน', 'เม็ดใหญ', 'ต้นใหญ', 'กกครึ่ง', 'ช้อนผัดข้าว', 'ต้า', 'มื้อ', 'ก้อนหั่', 'พวงเล็ก', 'ดอก', '.หอมแดง', 'ซีก', 'หรือ', 'แก่น', 'ถ้วยแก้ง', 'ช้อนตวง', 'ML', 'ต้ว', 'กระบวย',
                 'ถาด', 'ขาไก', 'ถ้วยตวงครึ่ง', 'ห่อ', 'h', 'ทัพพีครึ่ง', 'ชัอน', 'ช้อนแกงพูน', 'ตัวใหญ่ๆ', 'อัน', 'ถ้วยตะไล', 'ตัวขึ้นไป', 'ช้อนโต', 'ใบครึ่ง', 'คนอิ่ม', 'เม็ด', 'ใหญ', 'หน้าขนม', 'กรัมหรือ', 'ปั๊ม', 'หมูบด', 'รากใหญ', '.ดอกอัญชัน',
                 'ท', 'จะมีความกรอบนานกว่าแป้งสูตรท', 'ขวดใหญ', 'เสี้ยว', 'ชั่วโมง', 'รากผักช', 'เนื้อวัว', 'ถุง', 'ชต.ต่อน้ำเปล่', 'โป๊ยกั๊ก', 'มัด', 'เส้นสปาเก็ตต', 'อิ่ม', 'น้ำพริกกะป', 'น่อง', 'เส้นยาวๆ', 'ลูกเล็ก', 'ท่าน', 'ช.ช', 'หอยลาย', 'กก',
                 'ชั้นสไลด', 'ถูกใจ', 'ฟองต่อปลากระป๋', 'ครั้ง', 'ถ้วยเล็ก', 'เข่ง', 'ช้อนโต๊ะต', 'ค', 'ช้อนโต๊ะครึ่ง', 'กำมือ', 'People', 'นาทีอีกตะหาก', 'กุ้งสด', 'หม', 'ปลากรอบ', '.ไข่ไก', 'ช้อนทอดไข', 'โต๊ะ', 'ขนมจีน', 'ชตพูนๆ', 'หัวหอมใหญ',
                 'จานใหญๆครับ', 'ปลาหมึก', 'gm', 'kG', 'ตามชอบ', 'ข้าวเหนียว', 'เหยา', 'เนื้อสามชั้น', 'มิลลิกรัม', 'ชิ้นครึ่ง', 'กลีบหญ', 'ช้อนกาแฟ', 'หม้อขนาดกลาง', 'อย่าง', 'ก', 'แง่งใหญ', 'Tbs', 'ท่อน', 'กรีบเล็ก', 'จานใหญ่ๆ', 'pcs', 'ฟอง',
                 'oz', 'คา', '.น้ำตาลปี๊บ', 'ชิ้นฝ่ามือ', 'กระปุก', 'แท่ง', '.น้ำตาลทราย', 'กพ', 'ลิตร', 'กำใหญ', 'ถ้วยน้ำพริก', 'หัวขนาดกลาง', 'ขวด', 'เนื้อปลาทับทิม', 'เยาะ', 'หยิบมือ', '.ซุปคนอร์ก้อน', 'กะป', 'แท่งยาว', 'เเพ๊ค', 'กล่', 'กรีบ', 'แพ',
                 'หว', 'ช่อนโต๊ะ', 'ถต', 'ช้อนโต๊ะพูนๆ', 'ดวงหั่', 'ถ้วย', 'เสริ์ฟ', 'CC', 'แง่ง', 'ท่อนเล็ก', 'จุก', 'ขึด', 'เเว่น', 'มิลลิตร', 'ช้อนโจ๊ะ', 'ถ้', 'ชน', 'ช่อ', 'ใบใหญ', 'เเท่ง', 'ท่านข้าว', 'น้ำปลา', '.น้ำตาลแว่น', 'ผักบุ้ง', 'ถุงใหญ',
                 'คน', 'กิโลกรัมครึ่ง', 'กิโล', 'เกลอ', 'ช้อนโต๊ะหรือตามชอบ', 'servings', 'กระป๋อง', 'นิ้ว', 'กระป๋องครึ่ง', 'กำ', 'เข่งเล็ก', '.วุ้นเส้น', 'ห', 'ถ', 'แผ่น', 'ขา', 'ชุด', 'ชข', 'ชิ้น', 'จา', 'ปลาอินทรีย์แดดเดียว', 'ใบแก่ๆ', 'หัว',
                 '.มันหมูหั่นชิ้นบาง', 'ช้อน', 'เนื้อไก่หั่นเป็นชิ้น', '.น้ำเปล่า', 'ช้อนเล็ก', 'ครึ่งนึงของประมาณไข', 'ช้อนโตีะ', 'กร้ม', 'ลูห', 'อกไก', 'มะเขือยาว', 'สะโพก', 'ห่อกลาง', 'แท่งกลาง', 'พริกหยวก' , '.เครื่องปรุงรส', 'ปลาทูสด', 'ล', 'ของขวดขนาด',
                 'ชั้น', 'กล่องใหญ', 'ชิ้นเล็ก', 'ฟัก', '.ใบมะกรูด', 'ถ้วยหรือครึ่งหม้อน้ำย่อม', 'tsp', 'กลับ', 'ชต.ครึ่ง', 'ครอบครัวใหญ', 'ยอด', '.ซอสปรุงรส', '.ปลากระป๋อง', 'ฝัก', 'เนื้อวัวสับ', 'แพค', 'ชาม', 'kg', 'กวางตุ้ง', 'กล่องเล็ก', '.ข่า',
                 'เส้นบะหมี่กึ่งสำเร็จรูป', 'เสิร์ฟ', 'ถ้วยตวง', 'คนทานได้สบายๆ', 'หมึกสายลวก', 'ป๋อง', 'ไม', 'กรัมหลังปรุงเสร', 'เนื้อไก่หั่นเป็นชิ้นพอดีคำ', 'ท่านขึ้นไป', 'ขวดโหล', 'หรัม', 'ค่อนทัพพ', 'กีบ', 'ถ้วยถวง', 'หม้อใหญ', 'ลูกใหญ', 'มัดใหญ', 'ถุว',
                 'ส', 'ชิ้นใหญ', 'จับ', 'พริกชี้ฟ้าแดง', 'โล', 'ช้อนกินข้าว', 'ฟองแต่ไข่หมดพอด', 'กรอบ', '.กระเทียมสด', 'ช้านชา', 'คร', 'เท่าของปริมาณไข', 'แพ็คเล็ก', 'ตัวใหญ', '.', 'พริกขี้หน', 'กระท', 'กรัมม', 'กัอน', 'กิโลกรัท', 'ใบ', 'ผู้ใหญ',
                 'กระเทียบบุบ', 'pieces', 'อย่างค่ะ', 'กิโลครึ่ง', 'ช้อนโต้ะหรือตามชอบ', '.น้ำหวานบลูบอยสีแดง', 'รอบ', 'people', 'ก้อ นแล้วแต่ขนาด', 'น่องไก', 'ช้อรโต๊ะ', 'ช่อนชา', 'กุ้งสดลวด', 'ซองเล็ก', 'กล่อง', 'ช้อนสำหรับน้ำซุป', 'ออน', 'มิลลิลิตร',
                 'เนื้อปลากะพง', 'ปลากะพง', 'เนื้อไก', 'กระเทียมสำหรับหมักไก', 'ซีกเล็ก', 'จานพูนๆ', 'ป', 'ช้อนโต๊ะพูน', 'ช้อนชา', 'ของกล่องนม', 'ตัวแหนะ', 'ต้นต่']

def load_progress(filename):
    try:
        with open(filename, 'r', encoding='utf-8') as f:
            data = json.load(f)
            return data['data'], data['index']
    except FileNotFoundError:
        return {}, 0

def save_progress(filename, data, index):
    with open(filename, 'w', encoding='utf-8') as f:
        json.dump({'data': data, 'index': index}, f, indent=4, ensure_ascii=False)


units = ["cup", "cups", "tbsp", "tsp", "ounce", "oz", "g", "cc", "gram", "kg", "pound", "lb", "ea", "pcs", "ml", "L", "gallon", "handful", "splash", "pinch", "drop", "package", "can", "jar", "bottle", "bunch", "clove", "slice", "head", "dash", "sprig"]
convert_units, start_index = load_progress("unitConverter.json")
printing = []
if convert_units == {}:
    for unit in units:
        convert_units[unit] = [unit]

for index, unit in enumerate(units):
    printing.append(f"{index + 1}. {unit}")
printing.append(f"{len(units) + 1}. Other")
printing.append(f"{len(units) + 2}. Ignore")
printing.append(f"{len(units) + 3}. Remove")

for idx, pos_unit in enumerate(possible_unit[start_index:], start=start_index):

    table = PrettyTable()
    max_length = max(len(printing[0::3]), len(printing[1::3]), len(printing[2::3]))

    # Pad the lists with None to make them the same length
    col1 = printing[0::3] + [None] * (max_length - len(printing[0::3]))
    col2 = printing[1::3] + [None] * (max_length - len(printing[1::3]))
    col3 = printing[2::3] + [None] * (max_length - len(printing[2::3]))

    # Add the columns to the table
    table.add_column("Column 1", col1)
    table.add_column("Column 2", col2)
    table.add_column("Column 3", col3)

    print(table)

    user_input = int(input(f"{idx+1}/{len(possible_unit)}Enter a unit that is equivalent to {pos_unit}: "))

    if user_input == len(units)+1:
        new_unit = input("Enter the new unit: ")
        convert_units[new_unit] = [pos_unit]
    elif user_input == len(units)+2:
        continue
    elif user_input == len(units)+3:
        convert_units["None"].append(pos_unit)
    elif user_input > len(units)+3:
        print("Invalid input")
        continue
    elif user_input == 0:
        break
    else:
        convert_units[units[user_input-1]].append(pos_unit)

    save_progress("unitConverter.json", convert_units, idx+1)
        
print(convert_units)
